Tekla Open API Reference for Tekla Structures 2025
AnalysisPartPositionProperties.AxisCoordinateZ Property
 The axis coordinate in the Z direction.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double AxisCoordinateZ { get; set; }
Public Property AxisCoordinateZ As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnalysisPartPositionProperties Class
Tekla.Structures.Analysis Namespace